#+BEGIN_COMMENT
.. title: Sentiment Analysis: Defining the Model
.. slug: sentiment-analysis-defining-the-model
.. date: 2020-12-23 15:46:13 UTC-08:00
.. tags: nlp,sentiment analysis,deep learning
.. category: NLP
.. link: 
.. description: Defining the Deep Learning Model
.. type: text
.. has_math: True
#+END_COMMENT
#+OPTIONS: ^:{}
#+TOC: headlines 3
#+PROPERTY: header-args :session ~/.local/share/jupyter/runtime/kernel-2e28ec70-08fc-4104-9f65-5037f4d362ac.json
#+BEGIN_SRC python :results none :exports none
%load_ext autoreload
%autoreload 2
#+END_SRC

*** Test It

#+begin_src python :results output :exports both
x = numpy.array([[-2.0, -1.0, 0.0], [0.0, 1.0, 2.0]], dtype=float)
relu_layer = Relu()
print("Test data is:")
print(x)
print("\nOutput of Relu is:")
actual = relu_layer(x)

print(actual)

expected = numpy.array([[0., 0., 0.],
                        [0., 1., 2.]])

expect(numpy.allclose(actual, expected)).to(be_true)
#+end_src

#+RESULTS:
: Test data is:
: [[-2. -1.  0.]
:  [ 0.  1.  2.]]
: 
: Output of Relu is:
: [[0. 0. 0.]
:  [0. 1. 2.]]

** The Dense class 

 Implement the forward function of the Dense class. 
 - The forward function multiplies the input to the layer (=x=) by the weight matrix (=W=).

\[
\mathrm{forward}(\mathbf{x},\mathbf{W}) = \mathbf{xW}
\]

 - You can use =numpy.dot= to perform the matrix multiplication.

 Note that for more efficient code execution, you will use the trax version of =math=, which includes a trax version of =numpy= and also =random=.

 Implement the weight initializer =new_weights= function
 - Weights are initialized with a random key.
 - The second parameter is a tuple for the desired shape of the weights (num_rows, num_cols)
 - The num of rows for weights should equal the number of columns in x, because for forward propagation, you will multiply x times weights.

 Please use =trax.fastmath.random.normal(key, shape, dtype=tf.float32)= to generate random values for the weight matrix. The key difference between this function and the standard =numpy= randomness is the explicit use of random keys, which need to be passed in. While it can look tedious at the first sight to pass the random key everywhere, you will learn in Course 4 why this is very helpful when
implementing some advanced models.
 - =key= can be generated by calling =random.get_prng(seed)= and passing in a number for the =seed=.
 - =shape= is a tuple with the desired shape of the weight matrix.
     + The number of rows in the weight matrix should equal the number of columns in the variable =x=.  Since =x= may have 2 dimensions if it represents a single training example (row, col), or three dimensions (batch_size, row, col), get the last dimension from the tuple that holds the dimensions of x.
     + The number of columns in the weight matrix is the number of units chosen for that dense layer.  Look at the =__init__= function to see which variable stores the number of units.
 - =dtype= is the data type of the values in the generated matrix; keep the default of =tf.float32=. In this case, don't explicitly set the dtype (just let it use the default value).

 Set the standard deviation of the random values to 0.1
 - The values generated have a mean of 0 and standard deviation of 1.
 - Set the default standard deviation =stdev= to be 0.1 by multiplying the standard deviation to each of the values in the weight matrix.

See how the fastmath.trax.random.normal function works.

#+begin_src python :results output :exports both
tmp_key = random.get_prng(seed=1)
print("The random seed generated by random.get_prng")
display(tmp_key)
#+end_src

#+RESULTS:
:RESULTS:
: The random seed generated by random.get_prng
: DeviceArray([0, 1], dtype=uint32)
:END:

#+begin_src python :results output :exports both
print("choose a matrix with 2 rows and 3 columns")
tmp_shape=(2,3)
print(tmp_shape)
#+end_src

#+RESULTS:
: choose a matrix with 2 rows and 3 columns
: (2, 3)

Generate a weight matrix
 Note that you'll get an error if you try to set dtype to tf.float32, where tf is tensorflow
 Just avoid setting the dtype and allow it to use the default data type

#+begin_src python :results output :exports both
tmp_weight = random.normal(key=tmp_key, shape=tmp_shape)

print("Weight matrix generated with a normal distribution with mean 0 and stdev of 1")
display(tmp_weight)
#+end_src

#+RESULTS:
:RESULTS:
: Weight matrix generated with a normal distribution with mean 0 and stdev of 1
: DeviceArray([[ 0.957307  , -0.9699291 ,  1.0070664 ],
:              [ 0.36619022,  0.17294823,  0.29092228]], dtype=float32)
:END:

#+begin_src python :results none
# UNQ_C4 (UNIQUE CELL IDENTIFIER, DO NOT EDIT)
# GRADED FUNCTION: Dense

class Dense(Layer):
    """
    A dense (fully-connected) layer.
    """

    # __init__ is implemented for you
    def __init__(self, n_units, init_stdev=0.1):
        
        # Set the number of units in this layer
        self._n_units = n_units
        self._init_stdev = init_stdev

    # Please implement 'forward()'
    def forward(self, x):

### START CODE HERE (Replace instances of 'None' with your code) ###

        # Matrix multiply x and the weight matrix
        dense = numpy.dot(x, self.weights)
        
### END CODE HERE ###
        return dense

    # init_weights
    def init_weights_and_state(self, input_signature, random_key):
        
### START CODE HERE (Replace instances of 'None' with your code) ###
        # The input_signature has a .shape attribute that gives the shape as a tuple
        input_shape = input_signature.shape

        # Generate the weight matrix from a normal distribution, 
        # and standard deviation of 'stdev'        
        w = (random.normal(key=random_key, shape=(input_shape[-1], self._n_units))
             ,* self._init_stdev)
        
### END CODE HERE ###     
        self.weights = w
        return self.weights
#+end_src

# Testing your Dense layer 
#+begin_src python :results output :exports both
dense_layer = Dense(n_units=10)  #sets  number of units in dense layer
random_key = random.get_prng(seed=0)  # sets random seed
z = numpy.array([[2.0, 7.0, 25.0]]) # input array 

dense_layer.init(z, random_key)
print("Weights are\n ",dense_layer.weights) #Returns randomly generated weights
output = dense_layer(z)
print("Foward function output is ", output) # Returns multiplied values of units and weights

expected_weights = numpy.array([
    [-0.02837108,  0.09368162, -0.10050076,  0.14165013,  0.10543301,  0.09108126,
     -0.04265672,  0.0986188,  -0.05575325,  0.00153249],
    [-0.20785688,  0.0554837,   0.09142365,  0.05744595,  0.07227863,  0.01210617,
     -0.03237354,  0.16234995,  0.02450038, -0.13809784],
    [-0.06111237,  0.01403724,  0.08410042, -0.1094358,  -0.10775021, -0.11396459,
     -0.05933381, -0.01557652, -0.03832145, -0.11144515]])

expected_output = numpy.array(
    [[-3.0395496,   0.9266802,   2.5414743,  -2.050473,   -1.9769388,  -2.582209,
      -1.7952735,   0.94427425, -0.8980402,  -3.7497487]])

expect(numpy.allclose(dense_layer.weights, expected_weights)).to(be_true)
expect(numpy.allclose(output, expected_output)).to(be_true)
#+end_src

#+RESULTS:
: Weights are
:   [[-0.02837108  0.09368162 -0.10050076  0.14165013  0.10543301  0.09108126
:   -0.04265672  0.0986188  -0.05575325  0.00153249]
:  [-0.20785688  0.0554837   0.09142365  0.05744595  0.07227863  0.01210617
:   -0.03237354  0.16234995  0.02450038 -0.13809784]
:  [-0.06111237  0.01403724  0.08410042 -0.1094358  -0.10775021 -0.11396459
:   -0.05933381 -0.01557652 -0.03832145 -0.11144515]]
: Foward function output is  [[-3.03954965  0.92668021  2.54147445 -2.05047299 -1.97693891 -2.58220917
:   -1.79527355  0.94427423 -0.89804017 -3.74974866]]

  
